Revit 2024 API
ParameterTypeId.GenericDepth Property
 "Depth"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId GenericDepth { get; }
Visual Basic
Public Shared ReadOnly Property GenericDepth As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ GenericDepth {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace